<?php

function withoutAccents($data) {
    $trimmed = ltrim(rtrim($data));
    //$convert = mb_convert_case($trimmed, MB_CASE_LOWER, "UTF-8");
    $convert = $trimmed;
    $patterns = array('/Á/', '/É/', '/Í/', '/Ó/', '/Ú/',
        '/À/', '/È/', '/Ì/', '/Ò/', '/Ù/',
        '/á/', '/é/', '/í/', '/ó/', '/ú/', '/ý/',
        '/à/', '/è/', '/ì/', '/ò/', '/ù/',
        '/â/', '/ê/', '/î/', '/ô/', '/û/',
        '/Â/', '/Ê/', '/Î/', '/Ô/', '/Û/',
        '/ä/', '/ë/', '/ï/', '/ö/', '/ü/', '/ÿ/',
        '/Ä/', '/Ë/', '/Ï/', '/Ö/', '/Ü/', '/Ÿ/',
        '/ã/', '/õ/', '/ñ/', '/å/', '/ø/', '/š/',
        '/Ã/', '/Õ/', '/Ñ/', '/Å/', '/Ø/', '/Š/',
        '/ç/', '/Ç/', '/&#287;/', '/&#305;/', '/ö/', '/&#351;/', '/ü/',
        '/Âº/');

    $replace = array('a', 'e', 'i', 'o', 'u',
        'a', 'e', 'i', 'o', 'u',
        'a', 'e', 'i', 'o', 'u', 'y',
        'a', 'e', 'i', 'o', 'u',
        'a', 'e', 'i', 'o', 'u',
        'a', 'e', 'i', 'o', 'u',
        'a', 'e', 'i', 'o', 'u', 'y',
        'a', 'e', 'i', 'o', 'u', 'y',
        'a', 'o', 'n', 'a', 'q', 's',
        'a', 'o', 'n', 'a', 'q', 's',
        'c', 'C', 'g', 'i', 'o', 's', 'u',
        'º');

    return preg_replace($patterns, $replace, $convert);
}